[
  {
    "id": 1,
    "company": "Marbrains",
    "new": true,
    "featured": true,
    "position": "Senior Frontend Developer",
    "role": "Frontend",
    "level": "Senior",
    "postedAt": "1d ago",
    "contract": "Full Time",
    "location": "Remote",
    "languages": ["HTML", "CSS", "JavaScript"],
    "tools": ["React"],
    "description": "We are looking for a highly skilled Senior Frontend Developer to join our team. The ideal candidate will have extensive experience with HTML, CSS, and JavaScript, and be proficient in React. You will be responsible for developing and implementing user interface components using React.js concepts and workflows such as Redux, Flux, and Webpack. You will ensure that these components and the overall application are robust and easy to maintain. You will coordinate with the rest of the team working on different layers of the infrastructure."
  },
  {
    "id": 2,
    "company": "Marbrains",
    "new": true,
    "featured": true,
    "position": "Fullstack Developer",
    "role": "Fullstack",
    "level": "Midweight",
    "postedAt": "1d ago",
    "contract": "Part Time",
    "location": "Remote",
    "languages": ["Python", "JavaScript"],
    "tools": ["React", "Django"],
    "description": "Join our dynamic team as a Fullstack Developer where you will design, develop, and maintain both front-end and back-end components of our web applications. You will work with Python and JavaScript, utilizing frameworks such as React for the frontend and Django for the backend. This role requires collaboration with designers and other developers to create high-quality software solutions."
  },
  {
    "id": 3,
    "company": "Marbrains",
    "new": true,
    "featured": false,
    "position": "Junior Frontend Developer",
    "role": "Frontend",
    "level": "Junior",
    "postedAt": "2d ago",
    "contract": "Part Time",
    "location": "Remote",
    "languages": ["JavaScript"],
    "tools": ["React", "Sass"],
    "description": "We are seeking a Junior Frontend Developer to join our team on a part-time basis. The successful candidate will be responsible for assisting in the development of our web applications using JavaScript, React, and Sass. This is an excellent opportunity for a motivated individual to grow their skills in a collaborative environment."
  },
  {
    "id": 4,
    "company": "Marbrains",
    "new": false,
    "featured": false,
    "position": "Software Engineer",
    "role": "FullStack",
    "level": "Midweight",
    "postedAt": "1w ago",
    "contract": "Full Time",
    "location": "Remote",
    "languages": ["JavaScript"],
    "tools": ["NodeJS"],
    "description": "As a Software Engineer at Marbrains, you will be responsible for developing and maintaining server-side logic, ensuring high performance and responsiveness to requests from the front-end. You should be proficient in JavaScript and experienced with NodeJS. You will work closely with other engineers and developers to create scalable and efficient web applications."
  },
  {
    "id": 5,
    "company": "Marbrains",
    "new": false,
    "featured": false,
    "position": "Junior Backend Developer",
    "role": "Backend",
    "level": "Junior",
    "postedAt": "2w ago",
    "contract": "Full Time",
    "location": "Remote",
    "languages": ["Ruby"],
    "tools": ["RoR"],
    "description": "We are looking for a Junior Backend Developer with a strong foundation in Ruby and Ruby on Rails (RoR). You will be responsible for maintaining and developing server-side logic, integrating front-end elements built by your coworkers into the application, and ensuring the performance, quality, and responsiveness of applications."
  },
  {
    "id": 6,
    "company": "Marbrains",
    "new": false,
    "featured": false,
    "position": "Junior Developer",
    "role": "Frontend",
    "level": "Junior",
    "postedAt": "2w ago",
    "contract": "Full Time",
    "location": "Remote",
    "languages": ["HTML", "JavaScript"],
    "tools": ["Sass"],
    "description": "Marbrains is seeking a Junior Developer to join our frontend team. The ideal candidate will be proficient in HTML and JavaScript, and have experience working with Sass. You will be responsible for assisting in the creation and maintenance of web applications, ensuring they are user-friendly and visually appealing."
  }
]
